FIO_Benchmark-suite/data/res-logs/dump/fio_results_20260217_201119/logs/precond_parallel_sequential_1M_4k_rand_init.log
precond_sda: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdb: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdc: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdd: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sde: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdf: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdg: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdh: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdi: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdj: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdk: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdl: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdm: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdn: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdo: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdp: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdq: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdr: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sds: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdt: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdu: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdv: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdw: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
precond_sdx: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.19
Starting 96 processes

precond_sda: (groupid=0, jobs=96): err= 0: pid=1659771: Wed Feb 18 06:51:57 2026
  write: IOPS=950, BW=950MiB/s (997MB/s)(20.0TiB/23124166msec); 0 zone resets
    slat (usec): min=13, max=24492, avg=51.51, stdev=16.57
    clat (msec): min=4, max=29411, avg=874.71, stdev=2668.53
     lat (msec): min=5, max=29411, avg=874.76, stdev=2668.53
    clat percentiles (msec):
     |  1.00th=[   33],  5.00th=[  100], 10.00th=[  107], 20.00th=[  132],
     | 30.00th=[  133], 40.00th=[  136], 50.00th=[  138], 60.00th=[  138],
     | 70.00th=[  140], 80.00th=[  142], 90.00th=[  818], 95.00th=[ 6477],
     | 99.00th=[14160], 99.50th=[16040], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  MiB/s): min=  191, max=13930, per=100.00%, avg=3013.29, stdev=50.14, samples=1435586
   iops        : min=   96, max=13897, avg=2940.81, stdev=50.21, samples=1435586
  lat (msec)   : 10=0.01%, 20=0.01%, 50=2.37%, 100=3.94%, 250=82.92%
  lat (msec)   : 500=0.55%, 750=0.18%, 1000=0.18%, 2000=0.79%, >=2000=9.07%
  cpu          : usr=0.07%, sys=0.03%, ctx=22068007, majf=0, minf=1628
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21977856,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=950MiB/s (997MB/s), 950MiB/s-950MiB/s (997MB/s-997MB/s), io=20.0TiB (23.0TB), run=23124166-23124166msec

Disk stats (read/write):
  sda: ios=1071/915738, merge=0/0, ticks=655815/492601277, in_queue=493257092, util=100.00%
  sdb: ios=1276/915743, merge=0/0, ticks=1655334/886704262, in_queue=888359597, util=100.00%
  sdc: ios=718/915682, merge=0/0, ticks=456585/513399037, in_queue=513855621, util=100.00%
  sdd: ios=766/915699, merge=0/0, ticks=526059/519236055, in_queue=519762114, util=100.00%
  sde: ios=2125/915743, merge=0/0, ticks=3335370/1038432520, in_queue=1041767890, util=100.00%
  sdf: ios=786/915743, merge=0/0, ticks=661461/531984501, in_queue=532645961, util=100.00%
  sdg: ios=1395/915695, merge=0/0, ticks=2069027/960673204, in_queue=962742231, util=100.00%
  sdh: ios=2014/915742, merge=0/0, ticks=7425957/1479846220, in_queue=1487272177, util=100.00%
  sdi: ios=429/915743, merge=0/0, ticks=535170/568754252, in_queue=569289422, util=100.00%
  sdj: ios=378/915697, merge=0/0, ticks=393225/511957464, in_queue=512350690, util=100.00%
  sdk: ios=628/915642, merge=0/0, ticks=1332018/823008931, in_queue=824340948, util=100.00%
  sdl: ios=451/915743, merge=0/0, ticks=658185/609576484, in_queue=610234669, util=100.00%
  sdm: ios=363/915741, merge=0/0, ticks=314497/497688128, in_queue=498002625, util=100.00%
  sdn: ios=863/915681, merge=0/0, ticks=2387674/1067626023, in_queue=1070013697, util=100.00%
  sdo: ios=912/915697, merge=0/0, ticks=2566049/1102537191, in_queue=1105103240, util=100.00%
  sdp: ios=767/915743, merge=0/0, ticks=1896991/985387818, in_queue=987284809, util=100.00%
  sdq: ios=437/915743, merge=0/0, ticks=413731/582513703, in_queue=582927434, util=100.00%
  sdr: ios=378/915693, merge=0/0, ticks=365247/511587596, in_queue=511952844, util=100.00%
  sds: ios=691/915742, merge=0/0, ticks=1421771/896295384, in_queue=897717154, util=100.00%
  sdt: ios=668/915720, merge=0/0, ticks=1432719/863965144, in_queue=865397863, util=100.00%
  sdu: ios=807/915743, merge=0/0, ticks=2152760/1032329011, in_queue=1034481772, util=100.00%
  sdv: ios=1070/915691, merge=0/0, ticks=2207077/944906124, in_queue=947113200, util=100.00%
  sdw: ios=410/915742, merge=0/0, ticks=456740/556893968, in_queue=557350709, util=100.00%
  sdx: ios=1182/915671, merge=0/0, ticks=3919737/1243943320, in_queue=1247863057, util=100.00%